Atualização do diagrama do readme
